Test/Jerome_Test/Framework/IIS/xml/21_wsn_notify.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsn="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:m1="http://www.tmforum.org/mtossj/ws/aservice" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://docs.oasis-open.org/wsn/b-2 http://docs.oasis-open.org/wsn/b-2.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/notificationconsumer/sc</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/fmw/wsdl/notc/v1-0/notify</wsa:Action>
    <wsa:RelatesTo>http://host:port/operation/1234</wsa:RelatesTo>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <wsn:Notify>
      <wsn:NotificationMessage>
        <wsn:ProducerReference>
          <wsa:Address>http://host:port/notificationconsumer/sc</wsa:Address>
        </wsn:ProducerReference>
        <wsn:Message>
          <!-- Insert here the notification payload of the operation -->
          <m1:batchNotificationMessage>
          </m1:batchNotificationMessage>
        </wsn:Message>
      </wsn:NotificationMessage>
    </wsn:Notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
